//------------------------------------------------------------------------
// ИМЕ НА ФАЙЛА: Calibration.cs
// НАСЛЕДЕН ОТ: -
// ЦЕЛ НА КЛАСА: Скриване на калибрационното меню
//------------------------------------------------------------------------

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Calibration : MonoBehaviour {
	public Texture boxTexture;
	
	//------------------------------------------------------------------------
	// ФУНКЦИЯ: OnGUI
	// Начертава бяла точка в центъра на екрана
	// ПАРАМЕТРИ:
	// - Няма
	//------------------------------------------------------------------------
    void OnGUI(){
		GUI.backgroundColor = new Color(0f, 0f, 0f, 0f);
        GUI.Box(new Rect((Screen.width/2f) - 25f/2, (Screen.height/2f) - 25f/2, 25f, 25f), boxTexture);
    }
	
	//------------------------------------------------------------------------
	// ФУНКЦИЯ: Update
	// Следи за натискане на бутона и затваря менюто
	// ПАРАМЕТРИ:
	// - Няма
	//------------------------------------------------------------------------
	public void Update(){
		if(Input.GetMouseButton(0)){
			Destroy(gameObject);
		}
	}
}