//------------------------------------------------------------------------
// ИМЕ НА ФАЙЛА: FaceCamera.cs
// НАСЛЕДЕН ОТ: -
// ЦЕЛ НА КЛАСА: Завъртане на обекта така че винаги за гледа към камерата
//------------------------------------------------------------------------

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class FaceCamera : MonoBehaviour {
	
	//------------------------------------------------------------------------
	// ФУНКЦИЯ: Update
	// Завърта обекта на всеки кадър, така че да сочи към камерата
	// ПАРАМЕТРИ:
	// - Няма
	//------------------------------------------------------------------------
	void Update () {
		gameObject.transform.LookAt(Camera.main.transform);
	}
}
