//------------------------------------------------------------------------
// ИМЕ НА ФАЙЛА: Info.cs
// НАСЛЕДЕН ОТ: -
// ЦЕЛ НА КЛАСА: Пази информация за избрания инструмент
//------------------------------------------------------------------------

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Info : MonoBehaviour {
	public string tool = "None";
	
	//------------------------------------------------------------------------
	// ФУНКЦИЯ: ChangeTool
	// Променя инструмента с подадения
	// ПАРАМЕТРИ:
	// - string s : Името на инструмента
	//------------------------------------------------------------------------
	public void ChangeTool(string s){
		tool = s;
	}
	
	//------------------------------------------------------------------------
	// ФУНКЦИЯ: ResetTool
	// Задава инструмента на неселектиран
	// ПАРАМЕТРИ:
	// - Няма
	//------------------------------------------------------------------------
	public void ResetTool(){
		tool = "None";
	}
}
